Discuss the concept of One-Hot-Encoding, Multicollinearity and the Dummy Variable Trap.  What is Nominal and Ordinal Variables ?

Salary Dataset of 52 professors having categorical columns. Apply dummy variables concept and one-hot-encoding on categorical columns.

One Hot Encoder():
    It is the process of converting data to prepare it fora an algorithm and get a better prediction.
    With the one hot encoder we convert each categorical value to a new categorial column and assign a binary value of 0 or 1

Multicollinearity and Dummy Variable Trap :

The Dummy variable trap is a scenario where there are attributes which are highly correlated (Multicollinear) and one variable predicts the value of others. When we use one hot encoding for handling the categorical data, then one dummy variable (attribute) can be predicted with the help of other dummy variables. Hence, one dummy variable is highly correlated with other dummy variables. 

Dummy Variable Trap leads to problem  known as Multicollinearity, and Multicollinearity occurs where there is a dependency between the independent features

This problem mainly occurs in Regression model
To reduce the probleM of multcollinearity one of the dummy variable has to be dropped

Nominal Variables

A nominal scale describes a variable with categories that do not have a natural order or ranking. You can code nominal variables with numbers if you want, but the order is arbitrary and any calculations, such as computing a mean, median, or standard deviation, would be meaningless.

Examples of nominal variables include:
genotype, blood type, zip code, gender, race, eye color, political party

Ordinal Variables

An ordinal scale is one where the order matters but not the difference between values.

Examples of ordinal variables include:
socio economic status (“low income”,”middle income”,”high income”), education level (“high school”,”BS”,”MS”,”PhD”), income level (“less than 50K”, “50K-100K”, “over 100K”), satisfaction rating (“extremely dislike”, “dislike”, “neutral”, “like”, “extremely like”).

### Dummy Variables

In [28]:
import numpy as np
import pandas as pd

In [6]:
File = pd.read_table("Dummy Variables File.txt",delim_whitespace = True)

In [7]:
File.head()

       sx    rk  yr         dg  yd     sl
0    male  full  25  doctorate  35  36350
1    male  full  13  doctorate  22  35350
2    male  full  10  doctorate  23  28200
3  female  full   7  doctorate  27  26775
4    male  full  19    masters  30  33696

In [8]:
File.shape

(52, 6)

In [9]:
File.dtypes

sx    object
rk    object
yr     int64
dg    object
yd     int64
sl     int64
dtype: object

In [10]:
File.columns

Index(['sx', 'rk', 'yr', 'dg', 'yd', 'sl'], dtype='object')

In [11]:
File.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sx      52 non-null     object
 1   rk      52 non-null     object
 2   yr      52 non-null     int64
 3   dg      52 non-null     object
 4   yd      52 non-null     int64
 5   sl      52 non-null     int64
dtypes: int64(3), object(3)
memory usage: 2.6+ KB

In [12]:
File.describe()

              yr         yd            sl
count  52.000000  52.000000     52.000000
mean    7.480769  16.115385  23797.653846
std     5.507536  10.222340   5917.289154
min     0.000000   1.000000  15000.000000
25%     3.000000   6.750000  18246.750000
50%     7.000000  15.500000  23719.000000
75%    11.000000  23.250000  27258.500000
max    25.000000  35.000000  38045.000000

Using Dummy Variable concept

In [27]:
dummies = pd.get_dummies(File, columns =["sx","rk","dg"])
dummies.head()

,yr,yd,sl,sx_female,sx_male,rk_assistant,rk_associate,rk_full,dg_doctorate,dg_masters
0,25,35,36350,0,1,0,0,1,1,0
1,13,22,35350,0,1,0,0,1,1,0
2,10,23,28200,0,1,0,0,1,1,0
3,7,27,26775,1,0,0,0,1,1,0
4,19,30,33696,0,1,0,0,1,0,1

In [25]:
df = pd.concat([File,dummies],axis = 1)
df.head()

,sx,rk,yr,dg,yd,sl,yr,yd,sl,sx_female,sx_male,rk_assistant,rk_associate,rk_full,dg_doctorate,dg_masters
0,male,full,25,doctorate,35,36350,25,35,36350,0,1,0,0,1,1,0
1,male,full,13,doctorate,22,35350,13,22,35350,0,1,0,0,1,1,0
2,male,full,10,doctorate,23,28200,10,23,28200,0,1,0,0,1,1,0
3,female,full,7,doctorate,27,26775,7,27,26775,1,0,0,0,1,1,0
4,male,full,19,masters,30,33696,19,30,33696,0,1,0,0,1,0,1

In [26]:
df.drop(["sx","rk","dg"],axis = 1)
df.head()

,sx,rk,yr,dg,yd,sl,yr,yd,sl,sx_female,sx_male,rk_assistant,rk_associate,rk_full,dg_doctorate,dg_masters
0,male,full,25,doctorate,35,36350,25,35,36350,0,1,0,0,1,1,0
1,male,full,13,doctorate,22,35350,13,22,35350,0,1,0,0,1,1,0
2,male,full,10,doctorate,23,28200,10,23,28200,0,1,0,0,1,1,0
3,female,full,7,doctorate,27,26775,7,27,26775,1,0,0,0,1,1,0
4,male,full,19,masters,30,33696,19,30,33696,0,1,0,0,1,0,1

### One Hot Encoder

In [29]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

In [33]:
columnTransformer = ColumnTransformer([("encoder",OneHotEncoder(),[0,1,3])],remainder = 'passthrough')
data = np.array(columnTransformer.fit_transform(File),dtype = str)
data[:5]

array([['0.0', '1.0', '0.0', '0.0', '1.0', '1.0', '0.0', '25.0', '35.0',
        '36350.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '1.0', '0.0', '13.0', '22.0',
        '35350.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '1.0', '0.0', '10.0', '23.0',
        '28200.0'],
       ['1.0', '0.0', '0.0', '0.0', '1.0', '1.0', '0.0', '7.0', '27.0',
        '26775.0'],
       ['0.0', '1.0', '0.0', '0.0', '1.0', '0.0', '1.0', '19.0', '30.0',
        '33696.0']], dtype='<U32')